In [1]:
import pandas as pd

In [5]:
df = pd.read_csv('data.csv')

this help me to load data frame

In [6]:
df.head()

                 ID,Name,Age,City,Salary
0         1,John Avery,35,New York,70000
1  2,Adelaide Smith,29,Los Angeles,62000
2      3,Michael Rivera,41,Chicago,58000
3           4,Grace Kim,33,Houston,49000
4         5,Tyler Johnson,28,Miami,52000

this shows the first five row of the data sets

In [7]:
df.shape

(5, 1)

this shows how many rows and coloum does data set have

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   ID,Name,Age,City,Salary  5 non-null      object
dtypes: object(1)
memory usage: 172.0+ bytes

In [10]:
df.describe()

               ID,Name,Age,City,Salary
count                                5
unique                               5
top     1,John Avery,35,New York,70000
freq                                 1

this shows that the count and the top one
and the value looks small

if i were a bussiness it helps me to understand the sales growth 
if i were a student it helps me to understand and increse my studies
if i were a teacher it helps me to take down the notes clearly

it is easy to understand and use compare to python 
i wont feeling confusing  about anyting 
no becoz i know that the data will be tough but i also know that i can crake it down